# Exercise 3: Join
[โจทย์หน้า: 75](https://luckkrit.github.io/cos3103/slides/2_68/sql_dml)

## Load data

In [1]:
%load_ext sql
# Show more rows in results
%config SqlMagic.displaylimit = 300

In [2]:
%sql postgresql://postgres:12345678@localhost:5432/postgres

Connecting to 'postgresql://postgres:***@localhost:5432/postgres'

In [3]:
%sql SELECT version()

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------------------------------------------------------------------------+
|                                 version                                 |
+-------------------------------------------------------------------------+
| PostgreSQL 18.1 on x86_64-windows, compiled by msvc-19.44.35221, 64-bit |
+-------------------------------------------------------------------------+

In [4]:
%sql SET search_path TO classicmodels, public

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

++
||
++
++

## Query

### 1. หา customer ทุกคนที่มาจาก USA  โดยแสดงข้อมูลตามนี้ customer number, name, city and state

In [5]:
%%sql
SELECT customerNumber, customerName, city, state, country
FROM customers 
WHERE country = 'USA'
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+----------------+------------------------------+---------------+-------+---------+
| customernumber |         customername         |      city     | state | country |
+----------------+------------------------------+---------------+-------+---------+
|      112       |      Signal Gift Stores      |   Las Vegas   |   NV  |   USA   |
|      124       | Mini Gifts Distributors Ltd. |   San Rafael  |   CA  |   USA   |
|      129       |       Mini Wheels Co.        | San Francisco |   CA  |   USA   |
|      131       |      Land of Toys Inc.       |      NYC      |   NY  |   USA   |
|      151       |      Muscle Machine Inc      |      NYC      |   NY  |   USA   |
+----------------+------------------------------+---------------+-------+---------+

### 2. แสดง customer name orderNumber และ orderDate โดยวันที่สั่งซื้อต้องอยู่ระหว่างวันที่ 2003-05-01 - 2004-05-01

#### ON

In [6]:
%%sql
SELECT 
  customerName,
  orderNumber,
  orderDate
FROM orders 
JOIN customers 
  ON customers.customerNumber = orders.customerNumber
WHERE orderDate BETWEEN '2003-05-01' AND '2004-05-01'
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+----------------------------+-------------+---------------------+
|        customername        | ordernumber |      orderdate      |
+----------------------------+-------------+---------------------+
|     Reims Collectables     |    10121    | 2003-05-07 00:00:00 |
|    Marseille Mini Autos    |    10122    | 2003-05-08 00:00:00 |
|     Atelier graphique      |    10123    | 2003-05-20 00:00:00 |
|     Signal Gift Stores     |    10124    | 2003-05-21 00:00:00 |
| Australian Collectors, Co. |    10125    | 2003-05-21 00:00:00 |
+----------------------------+-------------+---------------------+

#### USING

In [7]:
%%sql
select
    customername,
    ordernumber,
    orderdate
from
    orders
    JOIN customers USING (customernumber)
WHERE
    orderdate BETWEEN '2003-05-01' AND '2004-05-01'
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+----------------------------+-------------+---------------------+
|        customername        | ordernumber |      orderdate      |
+----------------------------+-------------+---------------------+
|     Reims Collectables     |    10121    | 2003-05-07 00:00:00 |
|    Marseille Mini Autos    |    10122    | 2003-05-08 00:00:00 |
|     Atelier graphique      |    10123    | 2003-05-20 00:00:00 |
|     Signal Gift Stores     |    10124    | 2003-05-21 00:00:00 |
| Australian Collectors, Co. |    10125    | 2003-05-21 00:00:00 |
+----------------------------+-------------+---------------------+

### 3. ค้นหา order ทั้งหมดที่จัดส่งแล้ว โดยแสดงcutomrt name, order number และ shipped date

In [14]:
%%sql
SELECT customername, ordernumber, shippeddate
FROM orders
JOIN customers USING (customernumber)
WHERE status = 'Shipped'
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+------------------------------+-------------+---------------------+
|         customername         | ordernumber |     shippeddate     |
+------------------------------+-------------+---------------------+
| Online Diecast Creations Co. |    10100    | 2003-01-10 00:00:00 |
|     Blauer See Auto, Co.     |    10101    | 2003-01-11 00:00:00 |
|       Vitachrome Inc.        |    10102    | 2003-01-14 00:00:00 |
|      Baane Mini Imports      |    10103    | 2003-02-02 00:00:00 |
|    Euro+ Shopping Channel    |    10104    | 2003-02-01 00:00:00 |
+------------------------------+-------------+---------------------+

### 4. แสดง order details ได้แก่ customer name, order number, product name, quantity ordered และ price ที่ quantity ordered มากกว่า 40

In [15]:
%%sql
SELECT customername, ordernumber, productcode, quantityordered, priceeach
FROM orders
    JOIN customers USING (customernumber)
    JOIN orderdetails  USING (ordernumber)
    JOIN products USING (productcode)
WHERE quantityordered > 40
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+------------------------------+-------------+-------------+-----------------+-----------+
|         customername         | ordernumber | productcode | quantityordered | priceeach |
+------------------------------+-------------+-------------+-----------------+-----------+
| Online Diecast Creations Co. |    10100    |   S18_2248  |        50       |   55.09   |
| Online Diecast Creations Co. |    10100    |   S24_3969  |        49       |   35.29   |
|     Blauer See Auto, Co.     |    10101    |   S24_1937  |        45       |   32.53   |
|     Blauer See Auto, Co.     |    10101    |   S24_2022  |        46       |   44.35   |
|       Vitachrome Inc.        |    10102    |   S18_1367  |        41       |   43.13   |
+------------------------------+-------------+-------------+-----------------+-----------+

### 5. สร้าง report ที่แสดง employees และ orders ที่พวกเขาดำเนินการผ่านลูกค้าของตน เฉพาะปี 2004 และ order status เป็น ```Shipped``` หรือ ```Resolved```

In [30]:
%%sql
SELECT 
    employeenumber, 
    orders.customernumber, 
    ordernumber, 
    orderdate, 
    status
FROM employees
    JOIN customers ON customers.salesrepemployeenumber = employees.employeenumber
    # JOIN orders ON orders.customernumber = customers.customernumber
    JOIN orders USING (customernumber)
WHERE 
    extract(year from orderdate) = 2004 AND
    status IN ('Shipped', 'Resolved')
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+----------------+----------------+-------------+---------------------+---------+
| employeenumber | customernumber | ordernumber |      orderdate      |  status |
+----------------+----------------+-------------+---------------------+---------+
|      1370      |      103       |    10345    | 2004-11-25 00:00:00 | Shipped |
|      1370      |      103       |    10298    | 2004-09-27 00:00:00 | Shipped |
|      1166      |      112       |    10346    | 2004-11-29 00:00:00 | Shipped |
|      1166      |      112       |    10278    | 2004-08-06 00:00:00 | Shipped |
|      1611      |      114       |    10347    | 2004-11-29 00:00:00 | Shipped |
+----------------+----------------+-------------+---------------------+---------+

**ตัวอย่างการวิเคราะห์โจทย์**
- ถึงจะคนละชื่อแต่ ```salesrepemployeenumber``` สามารถชี้ไปที่ ```employeenumber```
- แปลว่า ```salesrepemployeenumber``` บอกได้ว่าพนักงานคนไหนรับผิดชอบลูกค้าคนไหน
- ชื่อต่างกันจึงใช้ ```on``` ในการ join

In [ ]:
%%sql
SELECT 
    concat(employees.firstname, ' ', employees.lastname) AS employeename,
    employeenumber, #จากตาราง employees
    salesrepemployeenumber, #จากตาราง customers
    customernumber
FROM employees
    JOIN customers ON customers.salesrepemployeenumber = employees.employeenumber
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+------------------+----------------+------------------------+----------------+
|   employeename   | employeenumber | salesrepemployeenumber | customernumber |
+------------------+----------------+------------------------+----------------+
| Gerard Hernandez |      1370      |          1370          |      103       |
| Leslie Thompson  |      1166      |          1166          |      112       |
|   Andy Fixter    |      1611      |          1611          |      114       |
| Gerard Hernandez |      1370      |          1370          |      119       |
|   Barry Jones    |      1504      |          1504          |      121       |
+------------------+----------------+------------------------+----------------+